# مساعدة الآلة الحاسبة

يمكنني استخدام QCalculator لمحرك الرياضيات ، ويمكن العثور عليه في
[https://github.com/xenotux/qcalc](https://github.com/xenotux/qcalc)
يمكن العثور على documentaion على [https://www.state-machine.com/qtools/qcalc.html](https://www.state-machine.com/qtools/qcalc.html) ،
يعجبني هذا المشروع ،
لذلك قمت بتقسيمه على [https://github.com/Light-Wizzard/qcalc](https://github.com/Light-Wizzard/qcalc) ،
وقد استخدمت بعض المستندات الخاصة بهم هنا ، وآمل أن أكتب قسم مساعدة أفضل لهذا المشروع.

***

أهم ميزة في QCalc هي أنه يقبل التعبيرات في <b> بناء جملة C </b> - بنفس المعاملات وقواعد الأسبقية كما هو الحال في الكود المصدري C أو C ++. من بين أمور أخرى،
يمكن أن تحتوي التعبيرات على جميع معاملات البت (`<<` ، `>>` ، `|` ، `&` ، `^` ، `~`) بالإضافة إلى نظام عشري مختلط ،
<b> الست عشري </ b> وحتى الثوابت الثنائية.

QCalc هي أيضًا آلة حاسبة علمية قوية للفاصلة العائمة وتدعم جميع الوظائف الرياضية
(`` sin () '' ، `cos () '،` tan ()' ، `exp ()` ، 'ln () `، ...).

بعض الأمثلة على التعبيرات المقبولة هي:
`((0xBEEF << 16) | 1280) & ~ 0xFF` - عوامل تشغيل ثنائية ، أرقام سداسية عشرية وأرقام عشرية مختلطة

`(1011 دولارًا << 24) | (1280 >> 8) ^ 0xFFF0` - أرقام ثنائية مختلطة ، وأرقام dec و hex

`(1234٪ 55) + 4321 // 33` - القسمة الباقية ، العدد الصحيح (لاحظ عامل القسمة الصحيحة` // `

"pi / 6" - ثابت pi

"pow (sin (ans)، 2) + pow (cos (ans)، 2)" - حسابات الفاصلة العائمة العلمية ،
[متغير الجواب] (https://www.state-machine.com/qtools/qcalc.html#qcalc_ans)

***

ملاحظة: يستخدم QCalc داخليًا أمر Python <b> EVAL </b> لتقييم التعبيرات.
يرجى الرجوع إلى توثيق [Python math expressions] (https://en.wikibooks.org/wiki/Python_Programming/Basic_Math)
لمزيد من التفاصيل حول البنية والميزات المدعومة.

# التحويل التلقائي إلى نظام سداسي عشري وثنائي

إذا كانت نتيجة تقييم التعبير عددًا صحيحًا (على عكس النقطة العائمة) ،
يعرض QCalc النتيجة تلقائيًا بتنسيقات سداسية عشرية وثنائية (انظر لقطة شاشة QCalc).
من أجل قراءة أفضل ، تُظهر الشاشة السداسية فاصلة عليا بين كلمتين نصفيتين 16 بت (على سبيل المثال ، `0xDEAD'BEEF`).
وبالمثل ، يظهر الإخراج الثنائي فاصلة عليا بين أربعة بايت 8 بت (على سبيل المثال ، "0b11011110'10101101'10111110'11101111`).

# الأعداد السداسية العشرية والثنائية

كإمتداد للبنية C ، يدعم QCalc كل من <b> الأرقام السداسية العشرية </ b> و <b> الأرقام الثنائية </ b>.
يتم تمثيل هذه الأرقام كـ "0x ..." و "0b ..." ، على التوالي ،
ويمكن خلطها في التعبيرات. فيما يلي بعض الأمثلة على هذه التعبيرات:

`(0b0110011 << 14) & 0xDEADBEEF (0b0010 | 0b10000) * 123`


# الجواب المتغير

يخزن QCalc نتيجة الحساب الأخير في متغير `ans`.
فيما يلي بعض الأمثلة على التعبيرات ذات المتغير `ans`:

"1 / الجواب" - أوجد معكوس آخر عملية حسابية

"log (ans) / log (2)" - ابحث عن log-base-2 لآخر حساب

# 64 بت النطاق

يدعم QCalc نطاق 64 بت ويتحول إلى حساب 64 بت تلقائيًا عندما يتجاوز <b> عدد صحيح </ b> نتيجة عملية حسابية نطاق 32 بت.
فيما يلي بعض الأمثلة على إخراج 64 بت:

""
> 0xDEADBEEF << 27
= 501427843159293952 | 0x06F5'6DF7'7800'0000
= 0b00000110'11110101'01101101'11110111'01111000'00000000'00000000'00000000
> 0xDEADBEEF << 24
= 62678480394911744 | 0x00DE'ADBE'EF00'0000
= 0b00000000'11011110'10101101'10111110'11101111'00000000'00000000'00000000
> 0xDEADBEEF << 34
! خارج النطاق
>
""

# معالجة الأخطاء

قد تحتوي التعبيرات التي تدخلها في QCalc على جميع أنواع الأخطاء: أخطاء بناء الجملة ،
أخطاء حسابية (على سبيل المثال ، القسمة على صفر) ، إلخ.
في جميع هذه الحالات ، يستجيب QCalc برسالة "خطأ" وشرح الخطأ:

""
> (2 * 4) +)
Traceback (آخر مكالمة أخيرة):
  ملف "\ ProgramPath \ qcalc.py" ، السطر 54 ، في _main
النتيجة = EVAL (expr)
  ملف "<string>" ، السطر الأول
(2 * 4) +)
^
خطأ في بناء الجملة: لا مثيل له ')'
>
""